
{"id":"15c8bd0553401d1e","threadId":"15c8bd0553401d1e","internalDate":"13:15:3 9/5/2017","snippet":"Dear Customer, Greetings from ICICI Bank. A purchase of INR 176.00 has been made using your Debit Card linked to ICICI Bank Account XX5400 on 09-Jun-17. Info: VIN*www tapzo i. The Available Balance in"}
{"id":"15c8b2b3ec944648","threadId":"15c8b23c5390940a","internalDate":"10:14:46 9/5/2017","snippet":"Hi, Thanks for your response. Following you request, I am very pleased to send you a PDF copy of my up-to-date resume as an attachment. I will be happy to supply you with any further information you"}
{"id":"15c8b3a38dacb8d2","threadId":"15c8b23c5390940a","internalDate":"10:31:7 9/5/2017","snippet":"Hi, I do not have any job offer currently. I had an internship with my previous employer and they would provide me full time after 2 months with CTC of 5.5 lpa. At TeamWave I would be expecting CTC of"}
{"id":"15c8b23c5390940a","threadId":"15c8b23c5390940a","internalDate":"10:6:35 9/5/2017","snippet":"Hi Amartya, This is Prasad from TeamWave. We had posted job posting in AngeIList Please share your updated CV. Thanks."}
{"id":"15c8b6d5d5ae05f1","threadId":"15c8b63a19ef5378","internalDate":"11:26:59 9/5/2017","snippet":"Hi, Thank you for your email regarding my interview details. I hereby confirm that I would attend the interview. Thanks, Amartya Sarkar On Fri, Jun 9, 2017 at 11:16 AM, Prasad KV &lt;prasad@"}
{"id":"15c8b63a19ef5378","threadId":"15c8b63a19ef5378","internalDate":"11:16:20 9/5/2017","snippet":"Hi Amartya, It was nice talking to you. We confirm the Interview with you on 10th June. Below are the details. Time: 12:30 pm Date: 10th June Venue: DoubleSpring Media, Frazer Town, Robertson Road,"}
{"id":"15c891925e32183e","threadId":"15c873838693dc75","internalDate":"0:35:44 9/5/2017","snippet":"Yes you will need to create a client id and secret."}
{"id":"15c87865df878dee","threadId":"15c87865df878dee","internalDate":"17:15:40 8/5/2017","snippet":"Strike connected to your Google Account Hi Amartya, Strike now has access to your Google Account amartya.2k9@gmail.com. Strike can: Read, send, delete, and manage your email You should only give this"}
{"id":"15c8b2d8dd8e3d44","threadId":"15c8b23c5390940a","internalDate":"10:17:16 9/5/2017","snippet":"Please share CTC details Current CTC: ? Expected CTC: ? Notice period: ? On Fri, Jun 9, 2017 at 10:14 AM, Amartya Sarkar &lt;amartya.2k9@gmail.com&gt; wrote: Hi, Thanks for your response. Following you"}
{"id":"15c8b49019ecbd1b","threadId":"15c8b49019ecbd1b","internalDate":"10:47:15 9/5/2017","snippet":"Dear Amartya Sarkar, via Exclusive Offer! Fly @ 1111 * Jet Airways Monsoon Sale Only Few Hours Left! Book Now Pay with MobiKwik &amp; Get up to ₹250 Cashback * . Know More OTHER OFFERS Holiday in"}
{"id":"15c8817d1864355b","threadId":"15c8817d1c258f6e","internalDate":"19:54:40 8/5/2017","snippet":"You matched with Sai Raju Penmetcha from Unitary Technologies (sairaju@unitary.io) because you both indicated interest in each other. Reply to this email, or use the app, to message Sai with a few"}
{"id":"15c88a1590f9bf06","threadId":"15c88a1590f9bf06","internalDate":"22:24:48 8/5/2017","snippet":"Google APIs Explorer connected to your Google Account You received this message because amartya.2k9@gmail.com is listed as the recovery email for amartya0011@gmail.com. If amartya0011@gmail.com is not"}
{"id":"15c8bfb34750b6f6","threadId":"15c8817d1c258f6e","internalDate":"14:1:54 9/5/2017","snippet":"Hey Amartya, I am from Unitary. Can you please share your number? We are interested to talk to you. Thanks, Sai"}
{"id":"15c882180bff9c25","threadId":"15c882180bff9c25","internalDate":"20:5:15 8/5/2017","snippet":"more details » Amartya Sarkar and Akshay Katyal Event Name: Interview Intro Call Phone Number: 9629778910 Angellist Profile: https://angel.co/amartya-sarkar-1 Github Profile: https://github.com/Amartya"}
{"id":"15c8add6e50d8bd7","threadId":"15c8add6e50d8bd7","internalDate":"8:49:46 9/5/2017","snippet":"Trending jobs for your profile! If you&#39;re having trouble viewing this email click here Download Android App andriod HeadHonchos Trending jobs for your profile A selection of jobs that are receiving"}
{"id":"15c887f38f47cdac","threadId":"15c86720d2fce755","internalDate":"21:47:35 8/5/2017","snippet":"Dear Customer, Greetings from ICICI Bank. A purchase of INR 153.85 has been made using your Debit Card linked to ICICI Bank Account XX5400 on 08-Jun-17. Info: VIN*PISCES ESER. The Available Balance in"}
{"id":"15c889136f83fed8","threadId":"15c88905867a66a7","internalDate":"22:7:16 8/5/2017","snippet":"Project Shutdown Announcement Your Google Cloud Platform project trans-invention-116415 was shut down on Thursday, June 8, 2017 4:36:58 PM UTC. If you take no action, after Saturday, July 8, 2017 4:36:"}
{"id":"15c8be7b0eabbc7c","threadId":"15c8be7b0eabbc7c","internalDate":"13:27:6 9/5/2017","snippet":"FreeCharge The world of entertainment awaits you! Sony Liv Alt Balaji ErosNow Download the FreeCharge mobile app now iPhone Windows Andriod For any queries or concerns, write to us at care@freecharge."}
{"id":"15c88fcac306afb9","threadId":"15c88fcac306afb9","internalDate":"0:4:38 9/5/2017","snippet":"http://www.cdn.geeksforgeeks.org/python-multiple-choice-questions/ LinkedIn Groups What&#39;s new in your groups GeeksforGeek... GeeksforGeeks All about Python MCQs By Dheeraj Jain http://www.cdn."}
{"id":"15c680c97fa0ba13","threadId":"15c680c97fa0ba13","internalDate":"14:34:33 2/5/2017","snippet":"more details » Interview Invite (Amartya) - SysCloud - PHP Developer - F2F Hi amartya, As discussed, your interview with SysCloud is confirmed and please find below the details: Date: 06th June, 2017"}
{"id":"15c88009ca940791","threadId":"15c88009ca940791","internalDate":"19:15:26 8/5/2017","snippet":"Anil Placed With Package Of 4.75 Lakhs in NOKIA. TestingCampusInfotech.org Congratulates Anil for getting placed.To get your dream JOBTo get your dream JOB Call +91 9632629033 With warm regards,"}
{"id":"15c878a46efaeed5","threadId":"15c878a46efaeed5","internalDate":"17:20:4 8/5/2017","snippet":"Hey Amartya, We&#39;re pumped you signed up for Strike! We&#39;ve created these two simple slides to get you upto speed: How to Send &amp; Schedule Tracked Emails How to Create Sequences (Automated"}
{"id":"15c8b72fd6b0740c","threadId":"15c8b72fd6b0740c","internalDate":"11:33:7 9/5/2017","snippet":"Please add jobs@jobs.shine.com to your Address Book or Safe List to prevent future Shine Updates from being classified as Junk / Bulk Mail Hi Amartya Sarkar, We have found following jobs similar to the"}
{"id":"15c88905867a66a7","threadId":"15c88905867a66a7","internalDate":"22:6:19 8/5/2017","snippet":"Project Shutdown Announcement Your Google Cloud Platform project turnkey-conduit-129216 was shut down on Thursday, June 8, 2017 4:35:52 PM UTC. If you take no action, after Saturday, July 8, 2017 4:35:"}
{"id":"15c8bd713d88f915","threadId":"15c8bd713d88f915","internalDate":"13:22:26 9/5/2017","snippet":"Logo Hi Amartya Sarkar, Your FreshMenu order FM5126586 is on its way to you &amp; should reach you in 30 mins. Please feel free to contact us in case you need any help. Order Number FM5126586 Estimated"}
{"id":"15c8bd06d35478fe","threadId":"15c8bd06d35478fe","internalDate":"13:15:10 9/5/2017","snippet":"Logo Hi Amartya Sarkar, Thanks for ordering from FreshMenu! Following are the details of what you ordered and when the order is expected to reach you. We&#39;ll let you know when we dispatch your order"}
{"id":"15c88811fb2db810","threadId":"15c86741f0f45871","internalDate":"21:49:40 8/5/2017","snippet":"Now you can relax. We&#39;ll will take care of everything else. . . . . . Order confirmed Order ID s4dc-gwc6 Hi Amartya, Thanks for ordering with foodpanda. Chutney Restaurant is preparing your order"}
{"id":"15c8891574ecdfc2","threadId":"15c8891574ecdfc2","internalDate":"22:7:24 8/5/2017","snippet":"You matched with Shuhaib Shariff from TeamWave (shuhaib@doublespring.com) because you both indicated interest in each other. Reply to this email, or use the app, to message Shuhaib with a few times you"}
{"id":"15c881314b8456a8","threadId":"15c881314b8456a8","internalDate":"19:49:29 8/5/2017","snippet":"Millions of premium high resolution images, right inside Sketch and PS - We&#39;re excited to share a new partnership ... Craft Stock by InVision powered by GET CRAFT STOCK NOW We&#39;re excited to"}
{"id":"15c8b1ff885bdd85","threadId":"15c8b1ff885bdd85","internalDate":"10:2:26 9/5/2017","snippet":"Day 25 of 30 Days of Code Hi Amartya, Welcome to Day 25. Can you believe we&#39;re in the last week of 30 Days of Code? Get familiar with the Big-O for today&#39;s Running Time challenge and determine"}
{"id":"15c87bcf7b0bc784","threadId":"15c87bcf7b0bc784","internalDate":"18:14:39 8/5/2017","snippet":"Hi Friends, Principal Global in Pune is the IT arm of Principal Financial Group which is world number 1 in multiple areas. It has used eLitmus to do its fresher hiring for 5 years now. We are proud"}
{"id":"15c8817d1c258f6e","threadId":"15c8817d1c258f6e","internalDate":"19:54:40 8/5/2017","snippet":"You matched with Sai Raju Penmetcha from Unitary Technologies (sairaju@unitary.io) because you both indicated interest in each other. Reply to this email, or use the app, to message Sai with a few"}
{"id":"15c88360679d9276","threadId":"15c88360679d9276","internalDate":"20:26:52 8/5/2017","snippet":"Hi Friends, Newspapers and news site are screaming about slow down in hiring within IT industry - not only that but layoffs as well. The other side of story is that demand for good candidates have gone"}
{"id":"15c8891350284757","threadId":"15c88905867a66a7","internalDate":"22:7:16 8/5/2017","snippet":"Project Shutdown Announcement Your Google Cloud Platform project my-project-1-1469958845411 was shut down on Thursday, June 8, 2017 4:36:37 PM UTC. If you take no action, after Saturday, July 8, 2017 4"}
{"id":"15c8746a5429a015","threadId":"15c8746a5429a015","internalDate":"16:6:12 8/5/2017","snippet":"Hey Amartya, Great to meet you. Can you pick up a slot here for a call: https://calendly.com/akatyal/15min"}
{"id":"15c81dbd21916ffd","threadId":"15c81dbd21916ffd","internalDate":"14:51:25 7/5/2017","snippet":"Logo Congratulations! You have earned a referral coupon. Thank you for signing up on Freshmenu We have added a ₹100 coupon, as promised, to your account. The coupon expires in 30 days. Order Now See"}
{"id":"15c876a3e6bf5615","threadId":"15c8757b4efb1f7b","internalDate":"16:45:5 8/5/2017","snippet":"Hey Amartya, Thanks for showing interest. We are a small software consulting company (7 of us right now). Our aim is to build a company around the individuals in it. We care about each one of us having"}
{"id":"15c8890c52225249","threadId":"15c88905867a66a7","internalDate":"22:6:47 8/5/2017","snippet":"Project Shutdown Announcement Your Google Cloud Platform project storied-shelter-129216 was shut down on Thursday, June 8, 2017 4:36:17 PM UTC. If you take no action, after Saturday, July 8, 2017 4:36:"}
{"id":"15c816d73eb0a504","threadId":"15c816d73eb0a504","internalDate":"12:50:52 7/5/2017","snippet":"PanOrbit Services LLP PanOrbit Services LLP sent you a message: Hi Amartya, We wish to thank you for the time you spent on the application. We appreciate your interest in PanOrbit. Unfortunately, we"}
{"id":"15c689ecdcf53b5e","threadId":"15c689ecdcf53b5e","internalDate":"17:14:16 2/5/2017","snippet":"Please add recruiter@shine.com to your Address Book or Safe List to prevent future Shine Updates from being classified as Junk/Bulk Mail. Hi Amartya Sarkar, Congratulations!! Recruiters are looking for"}
{"id":"15c86e6ddc7fd0f9","threadId":"15c86e6ddc7fd0f9","internalDate":"14:21:35 8/5/2017","snippet":"Your profile views Hi Amartya Sarkar, Congratulations! 3 recruiters have viewed your profile 5 times in the past 4 days. View recruiter details Please ensure that your profile is updated for recruiters"}
{"id":"15c8891a715425ae","threadId":"15c88905867a66a7","internalDate":"22:7:45 8/5/2017","snippet":"Project Shutdown Announcement Your Google Cloud Platform project rugged-truck-853 was shut down on Thursday, June 8, 2017 4:37:16 PM UTC. If you take no action, after Saturday, July 8, 2017 4:37:16 PM"}
{"id":"15c8383d57fd09e1","threadId":"15c8383d57fd09e1","internalDate":"22:34:33 7/5/2017","snippet":"Dear Amartya Sarkar, Thanks for registering for the pH Test to be held on Sunday, 11th Jun, 2017. This email is to inform you that we have not received your payment towards the applicable test fee yet."}
{"id":"15c880b864863f79","threadId":"15c880b864863f79","internalDate":"19:41:16 8/5/2017","snippet":"Dear Sir, Kindly find my resume for job application at GO-JEK. Sincerely, Amartya Sarkar"}
{"id":"15c8acf2d92dc43c","threadId":"15c8acf2d92dc43c","internalDate":"8:34:10 9/5/2017","snippet":"Help Ishita Sharma, Avnish Kapur and Sheshank Priyadarshi celebrate their birthdays Friday, June 9th Ishita Sharma Write on her Timeline Avnish Kapur Write on his Timeline Sheshank Priyadarshi Write on"}
{"id":"15c72ad0d63b526c","threadId":"15c72ad0d63b526c","internalDate":"16:5:56 4/5/2017","snippet":"Your Paytm Wallet Statement for May 2017 amartya.2k9@gmail.com | +91-9629778910 Opening Balance Rs.375.59 Total Amount Received Rs.2218 Total Amount Added Rs.2215 Total Amount Paid Rs.3727.13 Current"}
{"id":"15c865a2284daf4d","threadId":"15c85132c3bb5d51","internalDate":"11:47:53 8/5/2017","snippet":"Hi Imtiyaj, I saw you are interested in my profile. I am hereby sending you my resume for your reference. Regards, Amartya Sarkar On Thu, Jun 8, 2017 at 5:50 AM, Imtiyaj Kaji via AngelList Match &lt;no"}
{"id":"15c8c3bf161de743","threadId":"15c8c3bf161de743","internalDate":"15:12:33 9/5/2017","snippet":"Hi All, Greetings from Sprinklr- Social @ Scale! Thanks much for your interest with Sprinklr. Interviews will happen through Skype Can you all please rivert to me along with your CV and Skype ID asap."}
{"id":"15c7bb4453a742fe","threadId":"15c7bb4453a742fe","internalDate":"10:10:29 6/5/2017","snippet":"Transaction ID 11121931274 Transaction Date Jun 6, 2017 10:10:29 You added ₹500 to your Paytm wallet. Updated wallet balance is ₹773.36 How likely are you to recommend Paytm to a friend or colleague?"}
{"id":"15c72fce88b570aa","threadId":"15c72fce88b570aa","internalDate":"17:33:15 4/5/2017","snippet":"Logo Hi Amartya Sarkar, Thanks for ordering from FreshMenu! Following are the details of what you ordered and when the order is expected to reach you. We&#39;ll let you know when we dispatch your order"}
{"id":"15c7e4603bfa3c50","threadId":"15c7e4603bfa3c50","internalDate":"22:8:55 6/5/2017","snippet":"LinkedIn Amartya Sarkar 1 new job matching your search for Software Engineer in Vellore See all matching jobs PHP Developer Best Choice LTD Vellore, IN See all matching jobs Manage job alerts Contact"}
{"id":"15c85c63eda6790f","threadId":"15c85c63eda6790f","internalDate":"9:4:9 8/5/2017","snippet":"Recommended jobs for your Function. Grab them Now! If you&#39;re having trouble viewing this email click here Download Android App andriod HeadHonchos Job Recommendations | 08 June 2017 Dear Amartya,"}
{"id":"15c87654fe535b0f","threadId":"15c87654fe535b0f","internalDate":"16:39:19 8/5/2017","snippet":"Tapzo is one app for all apps. It helps you save data &amp; phone space. Tapzo : India&#39;s first all-in-one app SAVES 500MB PHONE SPACE Flights Outstation Cabs Deals Food Recharge Tapzo : India&#39;s"}
{"id":"15c645ae54941b26","threadId":"15c645ae54941b26","internalDate":"21:21:35 1/5/2017","snippet":"LinkedIn Amartya Sarkar Amartya Sarkar Your application is on its way. Good luck! Web Developer Urban Ladder Applied: 2 seconds ago › Here are similar jobs you may be interested in! Frontend Web"}
{"id":"15c7db0ec614e2c2","threadId":"15c7db0ec614e2c2","internalDate":"19:26:4 6/5/2017","snippet":"Dear Amartya Sarkar, Greetings from eLitmus. Hope you have received our earlier emails. Summarising below Joining IT services companies as fresher may not be the best career choice due to poor work"}
{"id":"15c77858e87239a8","threadId":"15c77858e87239a8","internalDate":"14:41:0 5/5/2017","snippet":"This event has been changed. more details » Interview Invite (Amartya) - SysCloud - PHP Developer - F2F Changed: Hi amartya, As discussed, your interview with SysCloud is confirmed and please find"}
{"id":"15c876a3ac3b44c5","threadId":"15c876a3ac3b44c5","internalDate":"16:45:4 8/5/2017","snippet":"You matched with Prabhas K from Vixta Solutions (vixtasolutions@gmail.com) because you both indicated interest in each other. Reply to this email, or use the app, to message Prabhas with a few times"}
{"id":"15c85132c3bb5d51","threadId":"15c85132c3bb5d51","internalDate":"5:50:44 8/5/2017","snippet":"You matched with Imtiyaj Kaji from Formobi Solutions Private limited (imtiyaj@formobi.in) because you both indicated interest in each other. Reply to this email, or use the app, to message Imtiyaj with"}
{"id":"15c690a8b1aa5409","threadId":"15c690a8b1aa5409","internalDate":"19:11:57 2/5/2017","snippet":"Answer: As per the trend that is being followed in Indian IT industry, TCS is.​.​.​ Quora Your Reading Digest Top Stories For You How is this that TCS is not doing layoffs? Sukanta Chakraborty Sukanta"}
{"id":"15c7659dd2d4e9ee","threadId":"15c7659dd2d4e9ee","internalDate":"9:13:20 5/5/2017","snippet":"Recommended jobs for your Function. Grab them Now! If you&#39;re having trouble viewing this email click here Download Android App andriod HeadHonchos Job Recommendations | 05 June 2017 Dear Amartya ,"}
{"id":"15c83915dd413016","threadId":"15c83915dd413016","internalDate":"22:49:7 7/5/2017","snippet":"LinkedIn Amartya Sarkar Top job picks for you Java UI Developer Ansell · Bengaluru Area, India Web Application Developer PayPal · Bengaluru Area, India 71 alumni Java UI Developer UCHP - new Volvo"}
{"id":"15c837cb5c5a136e","threadId":"15c837cb5c5a136e","internalDate":"22:26:46 7/5/2017","snippet":"Join Week of Code 33 Hi Amartya, We invite you to solve 6 challenges in 7 days by joining Week of Code 33! Beginning Monday, June 12th, we&#39;ll unlock one new challenge each day for you to solve. You"}
{"id":"15c873838693dc75","threadId":"15c873838693dc75","internalDate":"15:50:26 8/5/2017","snippet":"You matched with Akshay Katyal from Strike (ktyaks@gmail.com) because you both indicated interest in each other. Reply to this email, or use the app, to message Akshay with a few times you&#39;re"}
{"id":"15c81d3cddbd673f","threadId":"15c81d3cddbd673f","internalDate":"14:42:40 7/5/2017","snippet":"Logo The cart you left behind is waiting for you Hi Amartya, We were worried you forgot about your meal - you left food in your cart and forgot to checkout. Use the coupon code FMPBL9FTEVZ3R5 to get 10"}
{"id":"15c74f22e9449fe3","threadId":"15c74f22e9449fe3","internalDate":"2:39:13 5/5/2017","snippet":"Dear Customer, Your ICICI Bank account e-statement is now being sent to you as a pdf document. To open this file, you need Adobe Acrobat Reader. If you do not have Adobe Acrobat Reader, please visit"}
{"id":"15c88fa9310d63ad","threadId":"15c88fa9310d63ad","internalDate":"0:2:20 9/5/2017","snippet":"Hey Amartya, AMCAT takers are in demand. Top companies like MindTree, Nokia, SquadRun and many more are hiring big. Apply to these jobs and give your career the start it deserves. &quot; Instead of"}
{"id":"15c7ceea03f61285","threadId":"15c7ceea03f61285","internalDate":"15:45:38 6/5/2017","snippet":"Now you can relax. We&#39;ll will take care of everything else. . . . . . Order confirmed Order ID s7qe-kp90 Hi Amartya, Thanks for ordering with foodpanda. Dawat Restaurant is preparing your order now"}
{"id":"15c871bb51d0201d","threadId":"15c871bb51d0201d","internalDate":"15:18:39 8/5/2017","snippet":"Dear AMARTYA SARKAR , Amrita University M.Tech Phase III admissions ongoing. Apply soon to avail Scholarships and fellowships offered. More than 400+ companies visiting. Placement and six-month"}
{"id":"15c676dae4faa4e8","threadId":"15c676dae4faa4e8","internalDate":"11:41:0 2/5/2017","snippet":"Please add recruiter@shine.com to your Address Book or Safe List to prevent future Shine Updates from being classified as Junk/Bulk Mail. Hi Amartya Sarkar, Congratulations!! Recruiters are looking for"}
{"id":"15c86c34da71b2a9","threadId":"15c86c34da71b2a9","internalDate":"13:42:44 8/5/2017","snippet":"HackerEarth Best hackathons for you this week Gridlock Hackathon Gridlock Hackathon Status Live Ends In 21 Jun 2017, 11:55 PM IST Explore IndiaHacks 2017: Internet Of Things IndiaHacks 2017: Internet"}
{"id":"15c7d03705105ed2","threadId":"15c7d03705105ed2","internalDate":"16:16:35 6/5/2017","snippet":"AMCAT Job Alert AMCAT Logo Dear Amartya, Please find below the jobs that match your current profile at myamcat.com UPDATE PROFILE Now get instant job notifications on the AMCAT App. 52 New jobs added"}
{"id":"15c86f89835cccc2","threadId":"15c86f89835cccc2","internalDate":"14:40:57 8/5/2017","snippet":"See how well your profile stands out from the crowd. LinkedIn The power of your profile See how well your profile stands out from the crowd. 1 View A profile view from the right person is a step closer"}
{"id":"15c874e915ba8f11","threadId":"15c874e915ba8f11","internalDate":"16:14:51 8/5/2017","snippet":"more details » Amartya Sarkar and Akshay Katyal Event Name: Interview Intro Call Phone Number: 9629778910 Angellist Profile: https://angel.co/amartya-sarkar-1 Github Profile: https://github.com/Amartya"}
{"id":"15c6df7c0b3580ef","threadId":"15c6df7c0b3580ef","internalDate":"18:9:32 3/5/2017","snippet":"Answer: One year? Dude (or dudette)… There are many great companies.​ You migh.​.​.​ Quora Your Reading Digest Top Stories For You I am willing to sacrifice all of my free time to learn algorithms and"}
{"id":"15c6336b3ee63a6f","threadId":"15c6336b3ee63a6f","internalDate":"15:59:14 1/5/2017","snippet":""}
{"id":"15c6f0b2a94bea90","threadId":"15c6f0b2a94bea90","internalDate":"23:10:21 3/5/2017","snippet":"Dear Sir/Ma&#39;am, I heard about job opening at Amagi for front-end developers and I would like to apply for the same.I am currently in the final semester of my B.tech graduation, majoring in Computer"}
{"id":"15c7d008ae2f0a97","threadId":"15c7c82e3929862b","internalDate":"16:13:25 6/5/2017","snippet":"₹ 140.35 Thanks for choosing Uber, Amartya June 6, 2017 | uberPOOL 03:27pm | 358/1, Hosur Rd, Ayappa Garden, Adugodi, Bengaluru, Karnataka 560030, India 04:13pm | Service Rd, Chinappa Layout,"}
{"id":"15c83c6e0a07ecf0","threadId":"15c83c6e0a07ecf0","internalDate":"23:47:47 7/5/2017","snippet":"Profile visitors Ananya Borah Ananya Borah I like to call myself &#39;the People&#39;s Expert... Bengaluru View Profile ZZBUkhOf DIGRgFfmNDRk ZZBUkhOf DIGRgFfmNDRk View Profile See who visited your"}
{"id":"15c88328c36d236d","threadId":"15c8746a5429a015","internalDate":"20:23:52 8/5/2017","snippet":"Hey Amartya, Thanks for submitting the HackerRank solution. For the next steps, you&#39;ll have to work on a simple Nodejs app. Here are the details of what it should do: https://gist.github.com/MrDHat"}
{"id":"15c86914724304fd","threadId":"15c86914724304fd","internalDate":"12:48:7 8/5/2017","snippet":"Dear Sir, I had been following scoopwhoop for several days and I appreciate the work Scoopwhoop is doing. I would like to apply for the job at Scoopwhoop as a full stack developer. I am 2017 passout"}
{"id":"15c7c82e3929862b","threadId":"15c7c82e3929862b","internalDate":"13:56:10 6/5/2017","snippet":"₹ 125.16 Thanks for choosing Uber, Amartya June 6, 2017 | uberPOOL 01:03pm | Service Rd, Ferns City, Doddanekkundi, Bengaluru, Karnataka 560048, India 01:55pm | Raja Rammohan Roy Rd, Ambedkar Veedhi,"}
{"id":"15c8757b4efb1f7b","threadId":"15c8757b4efb1f7b","internalDate":"16:24:50 8/5/2017","snippet":"You matched with Rahul Jayaraman from ActiveSphere (rahul.jayaraman@activesphere.com) because you both indicated interest in each other. Reply to this email, or use the app, to message Rahul with a few"}
{"id":"15c7e51289790c36","threadId":"15c7ceea03f61285","internalDate":"22:21:6 6/5/2017","snippet":"Now you can relax. We&#39;ll will take care of everything else. . . . . . Order confirmed Order ID u4vc-7s2d Hi Amartya, Thanks for ordering with foodpanda. Maa Bhook Lagi is preparing your order now."}
{"id":"15c7c6b4f5947f39","threadId":"15c7c6b4f5947f39","internalDate":"13:30:18 6/5/2017","snippet":"Dear Candidate, We are hiring for the position of Research Associate. Job Location - Banglore Salary 3.5 Lpa - 4.5 Lpa Please apply on the job attached with this mail. Regards HR Team Please find the"}
{"id":"15c62abe6e753989","threadId":"15c62ab4436696ec","internalDate":"13:30:40 1/5/2017","snippet":"Dear Candidate, Greetings!!! This is to inform â€˜Target Education Academy is hiring for Physics Faculty in Hyderabadâ€™ Position: Physics Faculty Eligibility Criteria: BE/B.TECH Branch: Any Branch CTC"}
{"id":"15c62ab4436696ec","threadId":"15c62ab4436696ec","internalDate":"13:30:5 1/5/2017","snippet":"Dear Candidate, Greetings!!! This is to inform â€˜Target Education Academy is hiring for Physics Faculty in Hyderabadâ€™ Position: Physics Faculty Eligibility Criteria: BE/B.TECH Branch: Any Branch CTC"}
{"id":"15c69897d83685f9","threadId":"15c69897d83685f9","internalDate":"21:30:31 2/5/2017","snippet":"Hi amartya.2k9@gmail.com, mobikwik-logo Ta-Da! You have received as SuperCash! ₹ 16 for completing a transaction at foodpanda Below are the transaction details: SuperCash Amount: ₹ 16 Merchant Name:"}
{"id":"15c6228bd4fb70d0","threadId":"15c6228bd4fb70d0","internalDate":"11:7:34 1/5/2017","snippet":"HackerEarth amartya.2k9 Hello Amartya Sarkar, You have completed SDET-Hiring-College-Offcampus and we have received all your submissions. The summary of your test is as follows: Objective questions"}
{"id":"15c77753b3767976","threadId":"15c77753b3767976","internalDate":"14:23:10 5/5/2017","snippet":"in Bangalore ₹29 for 4km is back in Bangalore! You heard it right! For all uberPOOL rides between 11 AM and 5 PM in Bangalore this week, pay just ₹29 for upto 4 KM, and ₹49 for upto 8 KM! Valid on POOL"}
{"id":"15c72f19daf75c4a","threadId":"15c72f19daf75c4a","internalDate":"17:20:54 4/5/2017","snippet":"Logo The cart you left behind is waiting for you Hi Amartya, We were worried you forgot about your meal - you left food in your cart and forgot to checkout. Use the coupon code FMPB0N90YIOTZ0 to get 10"}
{"id":"15c67d9484d3d701","threadId":"15c67d9484d3d701","internalDate":"13:38:31 2/5/2017","snippet":"Add newsletter@email.payback.in to your address book. Having trouble viewing the email below? Click here PAYBACK PAYBACK Account Number: 9401165842960004 Link your Mobile No | Check Point Balance"}
{"id":"15c7712940c0bda5","threadId":"15c7712940c0bda5","internalDate":"11:56:27 5/5/2017","snippet":"Take a step towards a greener tomorrow Dear Customer, It is said that &#39;If we care for the environment, it will take care of us&#39;. As a responsible corporate citizen, ICICI Bank has stepped up"}
{"id":"15c72fcfccc520be","threadId":"15c72fcfccc520be","internalDate":"17:33:20 4/5/2017","snippet":"Now you can relax. We&#39;ll will take care of everything else. . . . . . Order confirmed Order ID u4ov-g19m Hi Amartya, Thanks for ordering with foodpanda. FreshMenu (Marathalli) is preparing your"}
{"id":"15c5fa6dfd31b8aa","threadId":"15c5fa6dfd31b8aa","internalDate":"23:26:29 31/4/2017","snippet":"LinkedIn Amartya Sarkar Amartya Sarkar Your application is on its way. Good luck! Web UI Developer Traform Inc Applied: 1 second ago › Here are similar jobs you may be interested in! Front End / UI/UX"}
{"id":"15c6c087dac3b1da","threadId":"15c6c087dac3b1da","internalDate":"9:5:41 3/5/2017","snippet":"Recommended jobs for your Function. Grab them Now! If you&#39;re having trouble viewing this email click here Download Android App andriod HeadHonchos Job Recommendations | 03 June 2017 Dear Amartya ,"}
{"id":"15c5fa032049aacf","threadId":"15c5fa032049aacf","internalDate":"23:19:12 31/4/2017","snippet":"LinkedIn Amartya Sarkar Top job picks for you UI Software Engineer (AngularJS) GE Healthcare · Bengaluru Area, India 3 company alumni Software Developer Boeing · Bengaluru Area, India 3 alumni Web UI"}
{"id":"15c64593d73b5134","threadId":"15c64593d73b5134","internalDate":"21:19:46 1/5/2017","snippet":"LinkedIn Amartya Sarkar Amartya Sarkar Your application is on its way. Good luck! Frontend Developer airtel Applied: 3 seconds ago › Here are similar jobs you may be interested in! Frontend Developer"}
{"id":"15c67b4c93e88394","threadId":"15c67b4c93e88394","internalDate":"12:14:56 2/5/2017","snippet":"FreeCharge Travel to the Horizon Dear FreeCharger, We all yearn to travel to new and exciting places. Top it up with discount coupons and the smile just grows wider. Choose from exciting travel coupons"}
{"id":"15c68c883c69dea8","threadId":"15c68c883c69dea8","internalDate":"17:59:49 2/5/2017","snippet":"Dear Amartya, At some point in life everyone has taken an examination; be it an exam for a government job or a PO exam for a Bank or trying to enroll your favorite course or degree. You know the pre-"}
{"id":"15c7cd2b909d263d","threadId":"15c7c82e3929862b","internalDate":"15:23:21 6/5/2017","snippet":"₹ 56.93 Thanks for choosing Uber, Amartya June 6, 2017 | uberPOOL 03:11pm | 1, Raja Rammohan Roy Rd, Sampangi Rama Nagar, Bengaluru, Karnataka 560001, India 03:23pm | 43, Adugodi Main Rd, ANGupta"}